<template>
    <section>
        <h1>Список сотрудников - ТЗ</h1>
        <p><b>Основные функции и требования:</b></p>
        <ul>
            <li>Инициализировать список контактов (id, фио, дата рождения)</li>
            <li>Сделать добавление - редактирование - удаление контакта</li>
            <li>Организовать поиск по списку контактов - начинать поиск после ввода 3х символов</li>
            <li>Сделать пагинацию</li>
            <li>Можно использовать bootstrap</li>
            <li>Использовать асинхронность</li>
            <li>Использовать компоненты</li>
            <li>Использовать typescript</li>

            <li>Выложить в резпозитарий</li>
        </ul>

        <p><b>Страницы:</b></p>
        <ul>
            <li>Список контактов с пагинацией и поиском</li>
            <li>Страница профиля контакта</li>
            <li>Диалоговое окно профиля контакта</li>
            <li>Страница добавления контакта</li>
        </ul>

        <hr>
        <p><a href=https://github.com/abcolut/sotrudnik-list>Github</a></p>
        <p><b>Исполнитель Сергей Михайлов:</b></p>
        <ul>
            <li>+7-918-125-52-05</li>
            <li><a href="https://wa.me/79181255205" target="_blank">+7-918-125-52-05 (whatsapp)</a></li>
            <li><a href="https://tlgg.ru/Serge_mikhailov" target="_blank">Telegram</a></li>
        </ul>

        Работа выполнена на Nuxt3. Composition API с использованием TypeScript
    </section>
</template>
